[
  {
    "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4OU9QUUx3EAE",
    "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUN4OU9QUUx3EAE!2m1!1s0x0:0x298d0be3c019ce4f!3m1!1s2@1:CIHM0ogKEICAgICx9OPQLw%7CCgsItp71ogYQsLzOIw%7C?hl=en",
    "author_title": "Martha Milne",
    "review_text": "Used AZ movers for the first time to help me move my piano from Edinburgh to Glasgow. Their service was spot on from start to finish. They replied quickly to emails, took care of my piano in transit and were able to change the date of moving at short notice, which I was very appreciative of. Great value for money and would use their services again definitely.",
    "review_rating": 5,
    "review_title": "Great service from start to finish"
  },
  {
    "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSek4yNWVnEAE",
    "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURSek4yNWVnEAE!2m1!1s0x0:0x298d0be3c019ce4f!3m1!1s2@1:CIHM0ogKEICAgIDRzN25eg%7CCgwI7vf_oQYQiN6uqgI%7C?hl=en",
    "author_title": "Rosalind Dolan",
    "review_text": "AZ Movers dealt with my move from the Lothians to the south of England.  From initial discussions with Victoria who made things seamless and reassured me that they could handle my move; Sacha visiting on a snowy evening to estimate and then Damien and his team of superheroes who did the packing quickly and professionally and then arriving safely in my new home.  Can't recommend them enough.",
    "review_rating": 5,
    "review_title": "Seamless and professional move to England"
  },
  {
    "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlam9MWmdBRRAB",
    "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURlam9MWmdBRRAB!2m1!1s0x0:0x298d0be3c019ce4f!3m1!1s2@1:CIHM0ogKEICAgIDejoLZgAE%7CCgwIgsWPmgYQsNv40QI%7C?hl=en",
    "author_title": "Simonida Cetkovic",
    "review_text": "My husband and I had a great experience with AZ Movers when we were moving from Edinburgh to London. The team is incredibly responsive, helpful, and friendly. They are extremely accommodating regarding dates, and the price was great.\n\nAfter struggling to find a mover for a week, we contacted them as the 5th movers and requested a quote - within 30 minutes all our worries were over. The 4th mover never even responded. We would have went with AZ Movers from the start if we had known our lives would be that much easier.",
    "review_rating": 5,
    "review_title": "Great moving experience from Edinburgh to London"
  },
  {
    "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtb3VqYzB3RRAB",
    "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUMtb3VqYzB3RRAB!2m1!1s0x0:0x298d0be3c019ce4f!3m1!1s2@1:CIHM0ogKEICAgIC-oujc0wE%7CCgsInaH6mgYQ-MyBVA%7C?hl=en",
    "author_title": "Rosie Benham",
    "review_text": "We found AZ Movers on CompareMyMove and they offered us the most competitive price for a long distance move from Edinburgh to Oxfordshire. We were impressed by them right from the start. They were cheerful, friendly and helpful at all times and were happy to work with our storage facility staff in Oxfordshire to unload and pack our rented storage room. We cannot speak too highly of them!",
    "review_rating": 5,
    "review_title": "Impressive long-distance move from Edinburgh to Oxfordshire"
  },
  {
    "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBeVBUaGRBEAE",
    "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNBeVBUaGRBEAE!2m1!1s0x0:0x298d0be3c019ce4f!3m1!1s2@1:CIHM0ogKEICAgICAyPThdA%7CCgsI4b7fzQUQgJv3fA%7C?hl=en",
    "author_title": "Ian Wright",
    "review_text": "Excellent recent experience with AZ Movers. I needed things moved from storage to a house in Glasgow. The two guys who did the removal were friendly, polite and very professional. They worked quickly and took care of everything without a hitch. Excellent value for money too and responded to emails quickly.",
    "review_rating": 5,
    "review_title": "Professional and smooth move from storage to house in Glasgow"
  },
  {
    "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJa3FPOVlBEAE",
    "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNJa3FPOVlBEAE!2m1!1s0x0:0x298d0be3c019ce4f!3m1!1s2@1:CIHM0ogKEICAgICIkqO9YA%7CCgwIhoL-3gUQh9DbqAM%7C?hl=en",
    "author_title": "Isabel Armstrong",
    "review_text": "I cannot fault this Company at all, from the beginning to end. At a very reasonable price. On the day of the move, the guys phoned to say they were running 10 minutes late. On arrival, they flawlessly removed the furniture without a mark on the walls, being very careful and efficient. Victoria called mid-morning to check how things were going. The 3 guys gave it their all, were very polite, and nothing was too much trouble. We couldn’t have managed without their help and experience. Well done AZ Movers, five stars awarded.",
    "review_rating": 5,
    "review_title": "Flawless move and excellent service"
  },
  {
    "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLemRTTGpnRRAB",
    "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURLemRTTGpnRRAB!2m1!1s0x0:0x298d0be3c019ce4f!3m1!1s2@1:CIHM0ogKEICAgIDKzdSLjgE%7CCgwI84aEhQYQsOvZnwM%7C?hl=en",
    "author_title": "LA",
    "review_text": "Thanks so much to Victoria and George for organising my move from London to Scotland. Victoria was very helpful and quick in her replies, the quote was extremely reasonable and nothing was too much trouble. George and his colleague were very friendly, helpful, and accommodating. They moved my belongings, including a piano, and were very careful and considerate. Thank you so much - I would highly recommend!",
    "review_rating": 5,
    "review_title": "Exceptional service for my London to Scotland move"
  },
  {
    "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBOU9EOXl3RRAB",
    "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURBOU9EOXl3RRAB!2m1!1s0x0:0x298d0be3c019ce4f!3m1!1s2@1:CIHM0ogKEICAgIDA9OD9ywE%7CCgwItpSg1QUQwP252gM%7C?hl=en",
    "author_title": "Jaci Carlucci",
    "review_text": "AZ Removals were great from start to finish. Dealing with Victoria was a pleasure, she was very professional, and every question I asked of her, she came back promptly. The two removal guys were absolutely brilliant, they arrived on time and dealt with a third-floor move so quickly and efficiently that I cannot praise them enough. Their quote was one of the most reasonable ones, and I took a chance on that, and so glad that I did! I will definitely use them again as they genuinely deserve their five stars!",
    "review_rating": 5,
    "review_title": "Great service with professional staff and reasonable pricing"
  },
  {
    "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHc3Z1dXVnRRAB",
    "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNHc3Z1dXVnRRAB!2m1!1s0x0:0x298d0be3c019ce4f!3m1!1s2@1:CIHM0ogKEICAgICGsvuuugE%7CCgsI07_aiwYQsKDeBQ%7C?hl=en",
    "author_title": "Kevin Paterson",
    "review_text": "I can’t recommend these guys enough. They were much cheaper than the company I normally use (and recommend). They were prompt, efficient, and very hardworking. They accommodated my unusual requests for collecting and delivering bulky old-fashioned furniture; nothing was too much trouble for them. I’d have no hesitation in using these guys again. I can’t recommend them highly enough! Top blokes!",
    "review_rating": 5,
    "review_title": "Exceptional service with great pricing and flexibility"
  },
  {
    "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxbVozNEV3EAE",
    "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNxbVozNEV3EAE!2m1!1s0x0:0x298d0be3c019ce4f!3m1!1s2@1:CIHM0ogKEICAgICqmZ34Ew%7CCgsIhYyPhgYQkO_xKg%7C?hl=en",
    "author_title": "Omer Jahangir Mughal",
    "review_text": "I had the best experience using this service. I used them twice for storage and moving a full 4-bedroom house plus a baby grand piano. They did it very professionally and within time. I highly recommend them.",
    "review_rating": 5,
    "review_title": "Exceptional service for large moves and storage"
  },
  {
    "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzeHVMMTJRRRAB",
    "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNzeHVMMTJRRRAB!2m1!1s0x0:0x298d0be3c019ce4f!3m1!1s2@1:CIHM0ogKEICAgICsxuL12QE%7CCgwI4_7M8QUQoPe0zgI%7C?hl=en",
    "author_title": "Mc Dales",
    "review_text": "Excellent! I hired AZ Movers for our 4-bedroom move from Edinburgh to Peterborough. I recommend them completely and will use them again in the near future.",
    "review_rating": 5,
    "review_title": "Highly recommend for long-distance moves"
  },
  {
    "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnaHNpSTVnRRAB",
    "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNnaHNpSTVnRRAB!2m1!1s0x0:0x298d0be3c019ce4f!3m1!1s2@1:CIHM0ogKEICAgICghsiI5gE%7CCgwInqax0wUQgJ3T6QE%7C?hl=en",
    "author_title": "Kira Голубева",
    "review_text": "Brilliant job for great money! The guys removed an old-fashioned upright piano from the ground to the first floor and all was done perfectly and on time! Well done!",
    "review_rating": 5,
    "review_title": "Excellent Service for Piano Move"
  },
  {
    "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLbFB1b1JBEAE",
    "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNLbFB1b1JBEAE!2m1!1s0x0:0x298d0be3c019ce4f!3m1!1s2@1:CIHM0ogKEICAgICKlPuoRA%7CCgwIoOmHgwYQoJL_3AI%7C?hl=en",
    "author_title": "Oliver Entwisle",
    "review_text": "They moved the piano down the tightest stairs I've seen in Edinburgh with no fuss, and were lovely people to top it off. Thanks very much.",
    "review_rating": 5,
    "review_title": "Efficient and Friendly Service"
  },
  {
    "review_title": "Really recommend",
    "review_id": "6657516fcce62cfbad9b4f2d",
    "review_link": "https://www.trustpilot.com/reviews/6657516fcce62cfbad9b4f2d",
    "author_title": "Lulu Wood",
    "review_text": "Really recommend them. They were extremely efficient, communicative, and accommodating. I paid £207 for five boxes to be transported from Edinburgh to London. They were flexible with the amount of boxes and the shape, type, weight, and contents of the boxes (unlike other companies that are so picky). They delivered and dropped off on time and gave me a narrow time window, so I didn’t have to wait around all day. I called several times with questions and this lovely lady always answered and was very clear and on the ball. She quickly changed my order for me at late notice. The delivery man was also very adaptive and communicative with timings. The service was really everything I wanted (my friends have had nightmare experiences with other companies like LoveSpace). So I really recommend AZ movers.",
    "review_rating": 5
  },
  {
    "review_title": "Great Customer service the movers we're…",
    "review_id": "5e32c9de3c93ae0b249a1f18",
    "review_link": "https://www.trustpilot.com/reviews/5e32c9de3c93ae0b249a1f18",
    "author_title": "Saher",
    "review_text": "Great Customer service the movers we're excellent! I highly recommend them Initially hired someone else but they couldn't move my wardrobe and piano up the 4th floor and after speaking with someone from the office she convinced me that they can do it!\n\nExcellent job by Gerry with my Piano & Dave!",
    "review_rating": 5
  },
  {
    "review_title": "It was a real pleasure working with…",
    "review_id": "5b2112bd6d33bc0fd865e449",
    "review_link": "https://www.trustpilot.com/reviews/5b2112bd6d33bc0fd865e449",
    "author_title": "Mukherjee Jaideep",
    "review_text": "It was a real pleasure working with Victoria. She ensured that the whole experience was as smooth as possible. AZ Movers organised the best moving company - they were efficient and friendly. The cleaners came out after the movers collected all my stuff and did a splendid job - every nook and cranny was sparkling. My end of tenancy experience was very smooth indeed with no complaints. I would use them in future without a doubt and would recommend them to anybody who wanted a hassle free experience. Well done AZ Movers and a big thank you!",
    "review_rating": 5
  },
  {
    "review_title": "Move easy with AZ Movers",
    "review_id": "60a103c8f9f4870b7005063b",
    "review_link": "https://www.trustpilot.com/reviews/60a103c8f9f4870b7005063b",
    "author_title": "Lesley-Ann Smith",
    "review_text": "Thanks so much to Victoria and George for organising my move from London to Scotland. Victoria was very helpful and quick in her replies, the quote was extremely reasonable and nothing was too much trouble. George and his colleague were very friendly, helpful and accommodating. They moved my belongings including a piano and were very careful and considerate. Thank you so much - I would highly recommend!",
    "review_rating": 5
  },
  {
    "review_title": "Book them now.",
    "review_id": "5c0ce6fa9d37800098883655",
    "review_link": "https://www.trustpilot.com/reviews/5c0ce6fa9d37800098883655",
    "author_title": "Sarah Neil",
    "review_text": "I found them on a search engine and they did not disappoint. All booking done by phone with a very friendly and efficient lady. During that phonecall she gave me my estimate then said that would be the price on the day. Done deal. Got a confirmation email with in minutes of the phone call ending.\nOn the day two young lads turned up early and went straight to work. Never complained and were constantly helpful ( in even trying to keep my stress level under control) one of them cut both his hands and just taped them up ( plasters were packed somewhere) and carried on.\nThe company were fantastic from beginning to end. At least £70 less than every other company I contacted. I can’t recommend them enough.",
    "review_rating": 5
  }
]
